fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикиОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресДанныхДокумента = Параметры.АдресДанныхДокумента;
	ДанныеДокумента = ПолучитьИзВременногоХранилища(АдресДанныхДокумента);
	Год = ДанныеДокумента["Год"];
	ОтпускаСотрудников.Загрузить(ДанныеДокумента["ОтпускаСотрудников"]);
	
	// Вывод диаграммы Ганта
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ОбластьЗаголовка.Текст = "График отпусков на " + Формат(Год, "ДФ=yyyy;") + " г.";
	Диаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	Диаграмма.АвтоОпределениеПолногоИнтервала = Истина;
	Шкала = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Вставить(0);
	Шкала.Единица = ТипЕдиницыШкалыВремени.Неделя;
	
	Серия = Диаграмма.Серии.Добавить();
	
	МассивЦветовСтиля = Новый Массив();
	МассивЦветовСтиля.Добавить(ЦветаСтиля.ДиаграммаГантаЦвет1);
	МассивЦветовСтиля.Добавить(ЦветаСтиля.ДиаграммаГантаЦвет2);
	МассивЦветовСтиля.Добавить(ЦветаСтиля.ДиаграммаГантаЦвет3);
	НомерЦвета = 0;
	Для Каждого Отпуск Из ОтпускаСотрудников Цикл
		Точка = Диаграмма.Точки.Добавить();
		Точка.Текст = Отпуск.Сотрудник;
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Цвет = МассивЦветовСтиля[НомерЦвета];
		Интервал.Начало = Отпуск.ДатаНачала;
		Интервал.Конец = КонецДня(Отпуск.ДатаОкончания);
		НомерЦвета = (НомерЦвета+1)% МассивЦветовСтиля.Количество(); 
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
